MELBAT03/mohamedelbatawi/wm_orca15_nedic_base24.09/software/source/os/port/tmpm370/src/startup_gcc.c
#include "TMPM370.h"
#include "core_cm3.h"
#include "core_cmFunc.h"

__attribute__((naked, noreturn)) void assert_failed(char const *module, int loc);

void __attribute__((weak)) Reset_Handler(void);
void __attribute__((weak)) NMI_Handler(void);
void __attribute__((weak)) HardFault_Handler(void);
void __attribute__((weak)) MemManage_Handler(void);
void __attribute__((weak)) BusFault_Handler(void);
void __attribute__((weak)) UsageFault_Handler(void);
void __attribute__((weak)) SVC_Handler(void);
void __attribute__((weak)) DebugMon_Handler(void);
void __attribute__((weak)) PendSV_Handler(void);
void __attribute__((weak)) SysTick_Handler(void);

void __attribute__((weak)) INT0_IRQHandler(void);        // 0:  Interrupt Pin (PH0/AINA0/96pin or 98pin)
void __attribute__((weak)) INT1_IRQHandler(void);        // 1:  Interrupt Pin (PH1/AINA1/95pin or 97pin)
void __attribute__((weak)) INT2_IRQHandler(void);        // 2:  Interrupt Pin (PH2/AINA2/94pin or 96pin)
void __attribute__((weak)) INT3_IRQHandler(void);        // 3:  Interrupt Pin (PA0/TB0IN/2pin or 4pin)
void __attribute__((weak)) INT4_IRQHandler(void);        // 4:  Interrupt Pin (PA2/TB1IN/4pin or 6pin)
void __attribute__((weak)) INT5_IRQHandler(void);        // 5:  Interrupt Pin (PE4/TB2IN//15pin or 17pin)
void __attribute__((weak)) INTRX0_IRQHandler(void);      // 6:  Serial reception (channel.0)
void __attribute__((weak)) INTTX0_IRQHandler(void);      // 7:  Serial transmit (channel.0)
void __attribute__((weak)) INTRX1_IRQHandler(void);      // 8:  Serial reception (channel.1)
void __attribute__((weak)) INTTX1_IRQHandler(void);      // 9:  Serial transmit (channel.1)
void __attribute__((weak)) INTVCNA_IRQHandler(void);     // 10: Vector Engine interrupt A
void __attribute__((weak)) INTVCNB_IRQHandler(void);     // 11: Vector Engine interrupt B
void __attribute__((weak)) INTEMG0_IRQHandler(void);     // 12: PMD0 EMG interrupt
void __attribute__((weak)) INTEMG1_IRQHandler(void);     // 13: PMD1 EMG interrupt
void __attribute__((weak)) INTOVV0_IRQHandler(void);     // 14: PMD0 OVV interrupt
void __attribute__((weak)) INTOVV1_IRQHandler(void);     // 15: PMD1 OVV interrupt
void __attribute__((weak)) INTADAPDA_IRQHandler(void);   // 16: ADCA conversion triggered by PMD0 is finished
void __attribute__((weak)) INTADBPDA_IRQHandler(void);   // 17: ADCB conversion triggered by PMD0 is finished
void __attribute__((weak)) INTADAPDB_IRQHandler(void);   // 18: ADCA conversion triggered by PMD1 is finished
void __attribute__((weak)) INTADBPDB_IRQHandler(void);   // 19: ADCB conversion triggered by PMD1 is finished
void __attribute__((weak)) INTTB00_IRQHandler(void);     // 20: 16bit TMRB0 compare match detection 0/ Over flow
void __attribute__((weak)) INTTB01_IRQHandler(void);     // 21: 16bit TMRB0 compare match detection 1
void __attribute__((weak)) INTTB10_IRQHandler(void);     // 22: 16bit TMRB1 compare match detection 0/ Over flow
void __attribute__((weak)) INTTB11_IRQHandler(void);     // 23: 16bit TMRB1 compare match detection 1
void __attribute__((weak)) INTTB40_IRQHandler(void);     // 24: 16bit TMRB4 compare match detection 0/ Over flow
void __attribute__((weak)) INTTB41_IRQHandler(void);     // 25: 16bit TMRB4 compare match detection 1
void __attribute__((weak)) INTTB50_IRQHandler(void);     // 26: 16bit TMRB5 compare match detection 0/ Over flow
void __attribute__((weak)) INTTB51_IRQHandler(void);     // 27: 16bit TMRB5 compare match detection 1
void __attribute__((weak)) INTPMD0_IRQHandler(void);     // 28: PMD0 PWM interrupt
void __attribute__((weak)) INTPMD1_IRQHandler(void);     // 29: PMD1 PWM interrupt
void __attribute__((weak)) INTCAP00_IRQHandler(void);    // 30: 16bit TMRB0 input capture 0
void __attribute__((weak)) INTCAP01_IRQHandler(void);    // 31: 16bit TMRB0 input capture 1
void __attribute__((weak)) INTCAP10_IRQHandler(void);    // 32: 16bit TMRB1 input capture 0
void __attribute__((weak)) INTCAP11_IRQHandler(void);    // 33: 16bit TMRB1 input capture 1
void __attribute__((weak)) INTCAP40_IRQHandler(void);    // 34: 16bit TMRB4 input capture 0
void __attribute__((weak)) INTCAP41_IRQHandler(void);    // 35: 16bit TMRB4 input capture 1
void __attribute__((weak)) INTCAP50_IRQHandler(void);    // 36: 16bit TMRB5 input capture 0
void __attribute__((weak)) INTCAP51_IRQHandler(void);    // 37: 16bit TMRB5 input capture 1
void __attribute__((weak)) INT6_IRQHandler(void);        // 38: Interrupt Pin (PE6/TB3IN//17pin or 19pin)
void __attribute__((weak)) INT7_IRQHandler(void);        // 39: Interrupt Pin (PE7/TB3OUT/18pin or 20pin)
void __attribute__((weak)) INTRX2_IRQHandler(void);      // 40: Serial reception (channel.2)
void __attribute__((weak)) INTTX2_IRQHandler(void);      // 41: Serial transmit (channel.2)
void __attribute__((weak)) INTADACPA_IRQHandler(void);   // 42: ADCA conversion monitoring function interrupt A
void __attribute__((weak)) INTADBCPA_IRQHandler(void);   // 43: ADCB conversion monitoring function interrupt A
void __attribute__((weak)) INTADACPB_IRQHandler(void);   // 44: ADCA conversion monitoring function interrupt B
void __attribute__((weak)) INTADBCPB_IRQHandler(void);   // 45: ADCB conversion monitoring function interrupt B
void __attribute__((weak)) INTTB20_IRQHandler(void);     // 46: 16bit TMRB2 compare match detection 0/ Over flow
void __attribute__((weak)) INTTB21_IRQHandler(void);     // 47: 16bit TMRB2 compare match detection 1
void __attribute__((weak)) INTTB30_IRQHandler(void);     // 48: 16bit TMRB3 compare match detection 0/ Over flow
void __attribute__((weak)) INTTB31_IRQHandler(void);     // 49: 16bit TMRB3 compare match detection 1
void __attribute__((weak)) INTCAP20_IRQHandler(void);    // 50: 16bit TMRB2 input capture 0
void __attribute__((weak)) INTCAP21_IRQHandler(void);    // 51: 16bit TMRB2 input capture 1
void __attribute__((weak)) INTCAP30_IRQHandler(void);    // 52: 16bit TMRB3 input capture 0
void __attribute__((weak)) INTCAP31_IRQHandler(void);    // 53: 16bit TMRB3 input capture 1
void __attribute__((weak)) INTADASFT_IRQHandler(void);   // 54: ADCA conversion started by software is finished
void __attribute__((weak)) INTADBSFT_IRQHandler(void);   // 55: ADCB conversion started by software is finished
void __attribute__((weak)) INTADATMR_IRQHandler(void);   // 56: ADCA conversion triggered by timer is finished
void __attribute__((weak)) INTADBTMR_IRQHandler(void);   // 57: ADCB conversion triggered by timer is finished
void __attribute__((weak)) INT8_IRQHandler(void);        // 58: Interrupt Pin (PA7/TB4IN/9pin or 11pin)
void __attribute__((weak)) INT9_IRQHandler(void);        // 59: Interrupt Pin (PD3/33pin or 35pin)
void __attribute__((weak)) INTA_IRQHandler(void);        // 60: Interrupt Pin (PL1/21pin or 23pin)
void __attribute__((weak)) INTB_IRQHandler(void);        // 61: Interrupt Pin (PL0/20pin or 22pin)
void __attribute__((weak)) INTENC0_IRQHandler(void);     // 62: Ender input0 interrupt
void __attribute__((weak)) INTENC1_IRQHandler(void);     // 63: Ender input1 interrupt
void __attribute__((weak)) INTRX3_IRQHandler(void);      // 64: Serial reception (channel.3)
void __attribute__((weak)) INTTX3_IRQHandler(void);      // 65: Serial transmit (channel.3)
void __attribute__((weak)) INTTB60_IRQHandler(void);     // 66: 16bit TMRB6 compare match detection 0 / Over flow
void __attribute__((weak)) INTTB61_IRQHandler(void);     // 67: 16bit TMRB6 compare match detection 1
void __attribute__((weak)) INTTB70_IRQHandler(void);     // 68: 16bit TMRB7 compare match detection 0 / Over flow
void __attribute__((weak)) INTTB71_IRQHandler(void);     // 69: 16bit TMRB7 compare match detection 1
void __attribute__((weak)) INTCAP60_IRQHandler(void);    // 70: 16bit TMRB6 input capture 0
void __attribute__((weak)) INTCAP61_IRQHandler(void);    // 71: 16bit TMRB6 input capture 1
void __attribute__((weak)) INTCAP70_IRQHandler(void);    // 72: 16bit TMRB7 input capture 0
void __attribute__((weak)) INTCAP71_IRQHandler(void);    // 73: 16bit TMRB7 input capture 1
void __attribute__((weak)) INTC_IRQHandler(void);        // 74: Interrupt Pin (PJ6/AINB9/74pin or 76 pin)
void __attribute__((weak)) INTD_IRQHandler(void);        // 75: Interrupt Pin (PJ7/AINB10/73pin or 75pin)
void __attribute__((weak)) INTE_IRQHandler(void);        // 76: Interrupt Pin (PK0/AINB11/72pin or 74pin)
void __attribute__((weak)) INTF_IRQHandler(void);        // 77: Interrupt Pin (PK1/AINB12/71pin or 73pin)

//*****************************************************************************
// Symbols defined in linker script

