MELBAT03/mohamedelbatawi/wm_orca15_nedic_base24.09/software/source/os/port/tmpm370/src/startup_gcc.c
// base of the stack
extern int __stack_end__;

// Start address for the initialization values of the .data section.
extern unsigned long _sidata;

// Start address for the .data section
extern unsigned long _sdata;

// End address for the .data section
extern unsigned long _edata;

// Start address for the .bss section
extern unsigned long _sbss;

// End address for the .bss section
extern unsigned long _ebss;

// End address for ram
extern void _eram;

//*****************************************************************************

extern int main(void);
extern void SystemInit(void);
__attribute__((used)) void Reset_Handler(void);
static void Default_Handler(void);

//*****************************************************************************

// The minimal vector table for a Cortex M3.  Note that the proper constructs
// must be placed on this to ensure that it ends up at physical address
// 0x00000000.

__attribute__((used, section(".isr_vector"))) int const g_pfnVectors[] =
    {
        (int)&__stack_end__,        // The initial stack pointer
        (int)&Reset_Handler,        // The reset handler
        (int)&NMI_Handler,          // The NMI handler
        (int)&HardFault_Handler,    // The hard fault handler
        (int)&MemManage_Handler,    // The MPU fault handler
        (int)&BusFault_Handler,     // The bus fault handler
        (int)&UsageFault_Handler,   // The usage fault handler
        0,                          // Reserved
        0,                          // Reserved
        0,                          // Reserved
        0,                          // Reserved
        (int)&SVC_Handler,          // SVCall handler
        (int)&DebugMon_Handler,     // Debug monitor handler
        0,                          // Reserved
        (int)&PendSV_Handler,       // The PendSV handler
        (int)&SysTick_Handler,      // The SysTick handler

        (int)&INT0_IRQHandler,        // 0:  Interrupt Pin (PH0/AINA0/96pin or 98pin)
        (int)&INT1_IRQHandler,        // 1:  Interrupt Pin (PH1/AINA1/95pin or 97pin)
        (int)&INT2_IRQHandler,        // 2:  Interrupt Pin (PH2/AINA2/94pin or 96pin)
        (int)&INT3_IRQHandler,        // 3:  Interrupt Pin (PA0/TB0IN/2pin or 4pin)
        (int)&INT4_IRQHandler,        // 4:  Interrupt Pin (PA2/TB1IN/4pin or 6pin)
        (int)&INT5_IRQHandler,        // 5:  Interrupt Pin (PE4/TB2IN//15pin or 17pin)
        (int)&INTRX0_IRQHandler,      // 6:  Serial reception (channel.0)
        (int)&INTTX0_IRQHandler,      // 7:  Serial transmit (channel.0)
        (int)&INTRX1_IRQHandler,      // 8:  Serial reception (channel.1)
        (int)&INTTX1_IRQHandler,      // 9:  Serial transmit (channel.1)
        (int)&INTVCNA_IRQHandler,     // 10: Vector Engine interrupt A
        (int)&INTVCNB_IRQHandler,     // 11: Vector Engine interrupt B
        (int)&INTEMG0_IRQHandler,     // 12: PMD0 EMG interrupt
        (int)&INTEMG1_IRQHandler,     // 13: PMD1 EMG interrupt
        (int)&INTOVV0_IRQHandler,     // 14: PMD0 OVV interrupt
        (int)&INTOVV1_IRQHandler,     // 15: PMD1 OVV interrupt
        (int)&INTADAPDA_IRQHandler,   // 16: ADCA conversion triggered by PMD0 is finished
        (int)&INTADBPDA_IRQHandler,   // 17: ADCB conversion triggered by PMD0 is finished
        (int)&INTADAPDB_IRQHandler,   // 18: ADCA conversion triggered by PMD1 is finished
        (int)&INTADBPDB_IRQHandler,   // 19: ADCB conversion triggered by PMD1 is finished
        (int)&INTTB00_IRQHandler,     // 20: 16bit TMRB0 compare match detection 0/ Over flow
        (int)&INTTB01_IRQHandler,     // 21: 16bit TMRB0 compare match detection 1
        (int)&INTTB10_IRQHandler,     // 22: 16bit TMRB1 compare match detection 0/ Over flow
        (int)&INTTB11_IRQHandler,     // 23: 16bit TMRB1 compare match detection 1
        (int)&INTTB40_IRQHandler,     // 24: 16bit TMRB4 compare match detection 0/ Over flow
        (int)&INTTB41_IRQHandler,     // 25: 16bit TMRB4 compare match detection 1
        (int)&INTTB50_IRQHandler,     // 26: 16bit TMRB5 compare match detection 0/ Over flow
        (int)&INTTB51_IRQHandler,     // 27: 16bit TMRB5 compare match detection 1
        (int)&INTPMD0_IRQHandler,     // 28: PMD0 PWM interrupt
        (int)&INTPMD1_IRQHandler,     // 29: PMD1 PWM interrupt
        (int)&INTCAP00_IRQHandler,    // 30: 16bit TMRB0 input capture 0
        (int)&INTCAP01_IRQHandler,    // 31: 16bit TMRB0 input capture 1
        (int)&INTCAP10_IRQHandler,    // 32: 16bit TMRB1 input capture 0
        (int)&INTCAP11_IRQHandler,    // 33: 16bit TMRB1 input capture 1
        (int)&INTCAP40_IRQHandler,    // 34: 16bit TMRB4 input capture 0
        (int)&INTCAP41_IRQHandler,    // 35: 16bit TMRB4 input capture 1
        (int)&INTCAP50_IRQHandler,    // 36: 16bit TMRB5 input capture 0
        (int)&INTCAP51_IRQHandler,    // 37: 16bit TMRB5 input capture 1
        (int)&INT6_IRQHandler,        // 38: Interrupt Pin (PE6/TB3IN//17pin or 19pin)
        (int)&INT7_IRQHandler,        // 39: Interrupt Pin (PE7/TB3OUT/18pin or 20pin)
        (int)&INTRX2_IRQHandler,      // 40: Serial reception (channel.2)
        (int)&INTTX2_IRQHandler,      // 41: Serial transmit (channel.2)
        (int)&INTADACPA_IRQHandler,   // 42: ADCA conversion monitoring function interrupt A
        (int)&INTADBCPA_IRQHandler,   // 43: ADCB conversion monitoring function interrupt A
        (int)&INTADACPB_IRQHandler,   // 44: ADCA conversion monitoring function interrupt B
        (int)&INTADBCPB_IRQHandler,   // 45: ADCB conversion monitoring function interrupt B
        (int)&INTTB20_IRQHandler,     // 46: 16bit TMRB2 compare match detection 0/ Over flow
        (int)&INTTB21_IRQHandler,     // 47: 16bit TMRB2 compare match detection 1
        (int)&INTTB30_IRQHandler,     // 48: 16bit TMRB3 compare match detection 0/ Over flow
        (int)&INTTB31_IRQHandler,     // 49: 16bit TMRB3 compare match detection 1
        (int)&INTCAP20_IRQHandler,    // 50: 16bit TMRB2 input capture 0
        (int)&INTCAP21_IRQHandler,    // 51: 16bit TMRB2 input capture 1
        (int)&INTCAP30_IRQHandler,    // 52: 16bit TMRB3 input capture 0
        (int)&INTCAP31_IRQHandler,    // 53: 16bit TMRB3 input capture 1
        (int)&INTADASFT_IRQHandler,   // 54: ADCA conversion started by software is finished
        (int)&INTADBSFT_IRQHandler,   // 55: ADCB conversion started by software is finished
        (int)&INTADATMR_IRQHandler,   // 56: ADCA conversion triggered by timer is finished
        (int)&INTADBTMR_IRQHandler,   // 57: ADCB conversion triggered by timer is finished
        (int)&INT8_IRQHandler,        // 58: Interrupt Pin (PA7/TB4IN/9pin or 11pin)
        (int)&INT9_IRQHandler,        // 59: Interrupt Pin (PD3/33pin or 35pin)
        (int)&INTA_IRQHandler,        // 60: Interrupt Pin (PL1/21pin or 23pin)
        (int)&INTB_IRQHandler,        // 61: Interrupt Pin (PL0/20pin or 22pin)
        (int)&INTENC0_IRQHandler,     // 62: Ender input0 interrupt
        (int)&INTENC1_IRQHandler,     // 63: Ender input1 interrupt
        (int)&INTRX3_IRQHandler,      // 64: Serial reception (channel.3)
        (int)&INTTX3_IRQHandler,      // 65: Serial transmit (channel.3)
        (int)&INTTB60_IRQHandler,     // 66: 16bit TMRB6 compare match detection 0 / Over flow
        (int)&INTTB61_IRQHandler,     // 67: 16bit TMRB6 compare match detection 1
        (int)&INTTB70_IRQHandler,     // 68: 16bit TMRB7 compare match detection 0 / Over flow
        (int)&INTTB71_IRQHandler,     // 69: 16bit TMRB7 compare match detection 1
        (int)&INTCAP60_IRQHandler,    // 70: 16bit TMRB6 input capture 0
        (int)&INTCAP61_IRQHandler,    // 71: 16bit TMRB6 input capture 1
        (int)&INTCAP70_IRQHandler,    // 72: 16bit TMRB7 input capture 0
        (int)&INTCAP71_IRQHandler,    // 73: 16bit TMRB7 input capture 1
        (int)&INTC_IRQHandler,        // 74: Interrupt Pin (PJ6/AINB9/74pin or 76 pin)
        (int)&INTD_IRQHandler,        // 75: Interrupt Pin (PJ7/AINB10/73pin or 75pin)
        (int)&INTE_IRQHandler,        // 76: Interrupt Pin (PK0/AINB11/72pin or 74pin)
        (int)&INTF_IRQHandler,        // 77: Interrupt Pin (PK1/AINB12/71pin or 73pin)
};

//*****************************************************************************

__attribute__((naked)) void DefaultReset_Handler(void)
{
    SystemInit();

    // Initialize data and bss
    unsigned long *pulSrc, *pulDest;

    // Copy the data segment initializers from flash to SRAM
    pulSrc = &_sidata;

    for (pulDest = &_sdata; pulDest < &_edata;)
    {
        *(pulDest++) = *(pulSrc++);
    }

    // Zero fill the bss segment.
    for (pulDest = &_sbss; pulDest < &_ebss;)
    {
        *(pulDest++) = 0;
    }

