MELBAT03/mohamedelbatawi/wm_orca15_nedic_base24.09/software/source/os/port/tmpm370/src/startup_gcc.c
#if 0
    /* Zero fill the bss segment.  This is done with inline assembly since this
     will clear the value of pulDest if it is not kept in a register. */
    __asm("  ldr     r0, =_sbss\n"
          "  ldr     r1, =_ebss\n"
          "  mov     r2, #0\n"
          "  .thumb_func\n"
          "zero_loop:\n"
          "    cmp     r0, r1\n"
          "    it      lt\n"
          "    strlt   r2, [r0], #4\n"
          "    blt     zero_loop");
#endif

    // Call the application's entry point.
    main();

    // main shouldn't return but assert just in case
    __asm volatile("  CPSID i");
    assert_failed("Reset_Handler", 1U);
}

//*****************************************************************************
//
// Provide weak aliases for each Exception handler to the DefaultIntHandler.
// As they are weak aliases, any function with the same name will override
// this definition.
//
//*****************************************************************************

#pragma weak Reset_Handler = DefaultReset_Handler
#pragma weak SVC_Handler = Default_Handler
#pragma weak DebugMon_Handler = Default_Handler
#pragma weak PendSV_Handler = Default_Handler
#pragma weak SysTick_Handler = Default_Handler

#pragma weak INT0_IRQHandler = Default_Handler
#pragma weak INT1_IRQHandler = Default_Handler
#pragma weak INT2_IRQHandler = Default_Handler
#pragma weak INT3_IRQHandler = Default_Handler
#pragma weak INT4_IRQHandler = Default_Handler
#pragma weak INT5_IRQHandler = Default_Handler
#pragma weak INTRX0_IRQHandler = Default_Handler
#pragma weak INTTX0_IRQHandler = Default_Handler
#pragma weak INTRX1_IRQHandler = Default_Handler
#pragma weak INTTX1_IRQHandler = Default_Handler
#pragma weak INTVCNA_IRQHandler = Default_Handler
#pragma weak INTVCNB_IRQHandler = Default_Handler
#pragma weak INTEMG0_IRQHandler = Default_Handler
#pragma weak INTEMG1_IRQHandler = Default_Handler
#pragma weak INTOVV0_IRQHandler = Default_Handler
#pragma weak INTOVV1_IRQHandler = Default_Handler
#pragma weak INTADAPDA_IRQHandler = Default_Handler
#pragma weak INTADBPDA_IRQHandler = Default_Handler
#pragma weak INTADAPDB_IRQHandler = Default_Handler
#pragma weak INTADBPDB_IRQHandler = Default_Handler
#pragma weak INTTB00_IRQHandler = Default_Handler
#pragma weak INTTB01_IRQHandler = Default_Handler
#pragma weak INTTB10_IRQHandler = Default_Handler
#pragma weak INTTB11_IRQHandler = Default_Handler
#pragma weak INTTB40_IRQHandler = Default_Handler
#pragma weak INTTB41_IRQHandler = Default_Handler
#pragma weak INTTB50_IRQHandler = Default_Handler
#pragma weak INTTB51_IRQHandler = Default_Handler
#pragma weak INTPMD0_IRQHandler = Default_Handler
#pragma weak INTPMD1_IRQHandler = Default_Handler
#pragma weak INTCAP00_IRQHandler = Default_Handler
#pragma weak INTCAP01_IRQHandler = Default_Handler
#pragma weak INTCAP10_IRQHandler = Default_Handler
#pragma weak INTCAP11_IRQHandler = Default_Handler
#pragma weak INTCAP40_IRQHandler = Default_Handler
#pragma weak INTCAP41_IRQHandler = Default_Handler
#pragma weak INTCAP50_IRQHandler = Default_Handler
#pragma weak INTCAP51_IRQHandler = Default_Handler
#pragma weak INT6_IRQHandler = Default_Handler
#pragma weak INT7_IRQHandler = Default_Handler
#pragma weak INTRX2_IRQHandler = Default_Handler
#pragma weak INTTX2_IRQHandler = Default_Handler
#pragma weak INTADACPA_IRQHandler = Default_Handler
#pragma weak INTADBCPA_IRQHandler = Default_Handler
#pragma weak INTADACPB_IRQHandler = Default_Handler
#pragma weak INTADBCPB_IRQHandler = Default_Handler
#pragma weak INTTB20_IRQHandler = Default_Handler
#pragma weak INTTB21_IRQHandler = Default_Handler
#pragma weak INTTB30_IRQHandler = Default_Handler
#pragma weak INTTB31_IRQHandler = Default_Handler
#pragma weak INTCAP20_IRQHandler = Default_Handler
#pragma weak INTCAP21_IRQHandler = Default_Handler
#pragma weak INTCAP30_IRQHandler = Default_Handler
#pragma weak INTCAP31_IRQHandler = Default_Handler
#pragma weak INTADASFT_IRQHandler = Default_Handler
#pragma weak INTADBSFT_IRQHandler = Default_Handler
#pragma weak INTADATMR_IRQHandler = Default_Handler
#pragma weak INTADBTMR_IRQHandler = Default_Handler
#pragma weak INT8_IRQHandler = Default_Handler
#pragma weak INT9_IRQHandler = Default_Handler
#pragma weak INTA_IRQHandler = Default_Handler
#pragma weak INTB_IRQHandler = Default_Handler
#pragma weak INTENC0_IRQHandler = Default_Handler
#pragma weak INTENC1_IRQHandler = Default_Handler
#pragma weak INTRX3_IRQHandler = Default_Handler
#pragma weak INTTX3_IRQHandler = Default_Handler
#pragma weak INTTB60_IRQHandler = Default_Handler
#pragma weak INTTB61_IRQHandler = Default_Handler
#pragma weak INTTB70_IRQHandler = Default_Handler
#pragma weak INTTB71_IRQHandler = Default_Handler
#pragma weak INTCAP60_IRQHandler = Default_Handler
#pragma weak INTCAP61_IRQHandler = Default_Handler
#pragma weak INTCAP70_IRQHandler = Default_Handler
#pragma weak INTCAP71_IRQHandler = Default_Handler
#pragma weak INTC_IRQHandler = Default_Handler
#pragma weak INTD_IRQHandler = Default_Handler
#pragma weak INTE_IRQHandler = Default_Handler
#pragma weak INTF_IRQHandler = Default_Handler

//*****************************************************************************

/* fault exception handlers ------------------------------------------------*/
__attribute__((naked)) void NMI_Handler(void);
void NMI_Handler(void)
{
    /* disable interrupts and reset SP in case of stack overflow */
    __set_MSP(__stack_end__);
    assert_failed("NMI", 1U);
}
/*..........................................................................*/
__attribute__((naked)) void HardFault_Handler(void);
void HardFault_Handler(void)
{
    /* disable interrupts and reset SP in case of stack overflow */
    __set_MSP(__stack_end__);
    assert_failed("HardFault", 1U);
}
/*..........................................................................*/
__attribute__((naked)) void MemManage_Handler(void);
void MemManage_Handler(void)
{
    /* disable interrupts and reset SP in case of stack overflow */
    __asm volatile("  CPSID i\n  MOV   sp,%0"
                   :
                   : "r"(&__stack_end__));
    assert_failed("MemManage", 1U);
}
/*..........................................................................*/
__attribute__((naked)) void BusFault_Handler(void);
void BusFault_Handler(void)
{
    /* disable interrupts and reset SP in case of stack overflow */
    __set_MSP(__stack_end__);
    assert_failed("BusFault", 1U);
}
/*..........................................................................*/
__attribute__((naked)) void UsageFault_Handler(void);
void UsageFault_Handler(void)
{
    /* disable interrupts and reset SP in case of stack overflow */
    __set_MSP(__stack_end__);
    assert_failed("UsageFault", 1U);
}
/*..........................................................................*/
__attribute__((naked)) void Default_Handler(void);
void Default_Handler(void)
{
    /* disable interrupts and reset SP in case of stack overflow */
    __set_MSP(__stack_end__);
    assert_failed("Default", 1U);
}
